<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2018/10/28
 * Time: 22:13
 */

$config = array(
    //数据库设置
    'database' => array(
        //MySQL服务器地址
        'host' => 'localhost',

        //MySQL登录用户名
        'user' => 'root',

        //MySQL登录密码
        'pass' => 'anne',

        //数据库名称
        'name' => 'qr_wenquan6_cn',

        //MySQL链接端口，默认3306
        'port' => 3306
    ),

    //验证码设置，留空关闭人机验证，请前往https://www.vaptcha.com/注册后创建验证单元获取vid和key
    'verification' => array(
        'vid'=>'',
        'key'=>''
    ),

    //导航设置
    'nav' => array(

        'CleverQQ'  => 'http://www.cleverqq.cn/',
        '温泉发卡网' => 'http://fkw.wenquan6.cn/'



        /*

        导航格式说明：
        '链接名称' => '链接地址'
        示例：'CleverQQ'  => 'http://www.cleverqq.cn/'

        多个导航请使用半角逗号隔开(除了最后一行，每行后面加个逗号)，如：
        'CleverQQ'  => 'http://www.cleverqq.cn/',
        '温泉发卡网' => 'http://fkw.wenquan6.cn/'

        */
    ),

    //系统其它设置
    'website'=>array(
        //页脚
        'footer'   => '©温泉网络 版权所有<br>附：出售本套PHP源码，价格100元，不限制使用域名，如有需要请联系QQ860859693',

        //常见问题
        'question' =>
            '
                    <b>1.合并后的收款码有扫码次数和时间限制吗？</b>
                    <p>&emsp;无限制扫码次数；永久可用。</p><br>
                    <b>2.合并后的二维码安全吗？</b>
                    <p>&emsp;安全。技术上，我们只是对三种类型的收款码进行合并，让用户收款使用更方便</p><br>
                    <b>3.别人扫码付款后，钱打到哪里去了？</b>
                    <p>&emsp;打到您的个人账户。具体来说：微信扫码付款时，钱打到您的微信钱包里；支付宝扫码付款时，钱打到您的支付宝账户里；QQ扫码付款时，钱打到您的QQ钱包里</p>
                    <br><b>4.为什么微信、QQ扫码后还需要长按识别？</b>
                    <p>&emsp;微信、QQ接口未开放权限，无法直接调起微信、QQ转账页面，所以需要长按识二维码别进行转账。（给您带来不便还请谅解）目前支付宝接口已开放权限。可以直接扫码付款。</p>
                    <br><b>5.使用此功能时，支付宝、微信、QQ会向我收取费用吗？</b>
                    <p>&emsp;不会。此功能是对二维码进行合并，不涉及微信、支付宝、QQ的收费问题。</p><p>
                        <br><b>6.在网站上传收款码会泄露用户隐私资料吗？</b>
                    </p><p>&emsp;不会。收款码是个人的收款二维码，是客户向对方转账的一种方式，和商家平时向客户展示的收款码是一样的。</p>
                    <br><b>7.合并后的二维码能通过微信或者支付宝或者QQ扫码转账码？</b>
                    <p>&emsp;可以。通过合并后的二维码可以自动识别用户扫码方式，微信扫码则使用微信支付，支付宝扫码则使用支付宝支付，QQ扫码则使用QQ支付</p>
                    <br><b>8.合并二维码对于商家有什么好处？</b>
                    <p>&emsp;①对于商家来说可免中间手续费，收款直接转入到商家个体账户，不需经过第三方公司提现。</p>
                    <p>&emsp;②一码在手，随扫随有：只保留一个扫码牌就可以了。</p>
                    <p>&emsp;③此功能免费使用</p>
                    <br><b>9.各通道的收款码在哪里获取？</b>
                    <p>&emsp;①QQ钱包/微信：手机QQ客户端右上角的"+"，收付款，二维码收款，保存收款码。</p>
                    <p>&emsp;②支付宝：支付宝客户端右上角"+"，收款，保存图片</p>
'
    ),


    //模板设置
    'template'=>array(
        '1' => array('x'=>160, 'y'=>153, 's'=>488),
        '2' => array('x'=>358, 'y'=>378, 's'=>361),
        '3' => array('x'=>616, 'y'=>522, 's'=>653),
        '4' => array('x'=>218, 'y'=>430, 's'=>637),
        '5' => array('x'=>370, 'y'=>585, 's'=>340),
        '6' => array('x'=>211, 'y'=>625, 's'=>654),
        '7' => array('x'=>65, 'y'=>130, 's'=>255),
        '8' => array('x'=>1215, 'y'=>340, 's'=>220),
        '9' => array('x'=>1720, 'y'=>405, 's'=>340),
        '10' => array('x'=>1227, 'y'=>1652, 's'=>1100),
        '11' => array('x'=>340, 'y'=>1215, 's'=>400),
        '12' => array('x'=>163, 'y'=>348, 's'=>246),
        '13' => array('x'=>370, 'y'=>480, 's'=>340),
        '14' => array('x'=>362, 'y'=>674, 's'=>250),
        '15' => array('x'=>340, 'y'=>610, 's'=>400),
        '16' => array('x'=>240, 'y'=>950, 's'=>600),
        '17' => array('x'=>240, 'y'=>900, 's'=>600),
        '18' => array('x'=>100, 'y'=>247, 's'=>140),
    )


);